#include "../Character/CharacterEnemy.h"
#include "../Others/Define.h"

/*-------------------------------------------*/
/* コンストラクタ
/*-------------------------------------------*/
CharacterEnemy::CharacterEnemy(UINT id, CharacterType type)
	:CharacterBase::CharacterBase(id,type)
{
	
}

/*-------------------------------------------*/
/* デストラクタ
/*-------------------------------------------*/
CharacterEnemy::~CharacterEnemy()
{
	
}

/*-------------------------------------------*/
/* 初期化
/*-------------------------------------------*/
void CharacterEnemy::Initialize()
{
	// キャラクター共通の初期化
	commonInitialize();
}

/*-------------------------------------------*/
/* 更新
/*-------------------------------------------*/
void CharacterEnemy::Update()
{
	// キャラクター共通の更新
	commonUpdate();
}

/*-------------------------------------------*/
/* 描画
/*-------------------------------------------*/
void CharacterEnemy::Draw()
{
	// キャラクター共通の描画
	commonDraw();
}

/*-------------------------------------------*/
/* コールバック関数：砲弾を発射したとき
/*-------------------------------------------*/
void CharacterEnemy::OnFiringShot()
{

}

/*-------------------------------------------*/
/* コールバック関数：砲弾がキャラクターにヒットしたとき
/*-------------------------------------------*/
void CharacterEnemy::OnCharacterHitShot()
{

}

/*-------------------------------------------*/
/* UIを描画
/*-------------------------------------------*/
void CharacterEnemy::DrawUi()
{

}

/*-------------------------------------------*/
/* スキルを発動
/*-------------------------------------------*/
void CharacterEnemy::ActivateSkill()
{
	
}