#include "../Character/CharacterEnemy.h"
#include "../Others/Define.h"

/*-------------------------------------------*/
/* コンストラクタ
/*-------------------------------------------*/
CharacterEnemy::CharacterEnemy(UINT id, CharacterType type)
	:CharacterBase::CharacterBase(id,type)
{
	// キャラクターのオブジェクトの種類を設定
	objectType = ObjectType::CHARACTER_ENEMY;
}

/*-------------------------------------------*/
/* デストラクタ
/*-------------------------------------------*/
CharacterEnemy::~CharacterEnemy()
{
	
}

/*-------------------------------------------*/
/* 初期化
/*-------------------------------------------*/
void CharacterEnemy::Initialize()
{
	// 共通のパラメータを初期化
	InitializeCommonParameter();
}

/*-------------------------------------------*/
/* 更新
/*-------------------------------------------*/
void CharacterEnemy::Update()
{
	// 共通のパラメータを更新
	UpdateCommonParameter();
}

/*-------------------------------------------*/
/* 描画
/*-------------------------------------------*/
void CharacterEnemy::Draw()
{
	// 共通のモデルを描画
	DrawCommonModel();
}

/*-------------------------------------------*/
/* コールバック関数：砲弾を発射したとき
/*-------------------------------------------*/
void CharacterEnemy::OnFiringShot()
{

}

/*-------------------------------------------*/
/* コールバック関数：砲弾がキャラクターにヒットしたとき
/*-------------------------------------------*/
void CharacterEnemy::OnCharacterHitShot()
{

}

/*-------------------------------------------*/
/* UIを描画
/*-------------------------------------------*/
void CharacterEnemy::DrawUi()
{

}

/*-------------------------------------------*/
/* スキルを発動
/*-------------------------------------------*/
void CharacterEnemy::ActivateSkill()
{
	
}